api/controllers/RecipientController.php

SELECT * FROM "recipient_mobile_info" WHERE ("recipient_mobile_index"=2) AND ("info_type"=1)
---
    public function actionUserLogin()
    {

        $params = ApiParams::getPostJsonParams();

        $model = Validation::TheUserLoginCorrectly($params);

        if($model->errors)
        {
            RecipientMobileInfo::setNewRecipientInfo($model, InfoTypes::BAD_LOGIN, $params);
            Utils::echoErrorResponse($model->getFirstErrors());
        }
        else
        {
            $user_info = RecipientMobileInfo::find()
                ->where([RecipientMobileInfo::RECIPIENT_MOBILE_INDEX => $model->index])
                ->andWhere([RecipientMobileInfo::INFO_TYPE => InfoTypes::LOGIN])
                ->one();