api/models/RecipientMobileHeartbeat.php

UPDATE "recipient_mobile_heartbeat" SET "device_id"='1', "heartbeat_time"='2016-01-25 14:20:12', "recipient_mobile_index"=2 WHERE "index"=57
---
    public function setNewLoginSession($model)
    {
        $this->auth_key = $this->setNewAuthKey();
        $this->device_id = $model->device_id;
        $this->heartbeat_time = Utils::getCurrentTime();
        $this->recipient_mobile_index = $model->index;
        if(!$this->save())

INSERT INTO "recipient_mobile_heartbeat" ("auth_key") VALUES ('b0322c1af0fbe02b4705b44d341a4b10') RETURNING "index"
---
    private function setNewAuthKey()
    {
        $bytes = openssl_random_pseudo_bytes(16, $cstrong);
        $hex   = bin2hex($bytes);
        $this->auth_key = $hex;
        if($this->save())