api/models/RecipientMobileLogin.php

SELECT * FROM "recipient_mobile_login" WHERE "device_id"='1'
---
    public static function getUserByDeviceID($device_id)
    {
        return self::findOne(["device_id" => $device_id]);

SELECT * FROM "recipient_mobile_login" WHERE "recipient_code"='avi'
---
    public static function getUserByCode($userLogin)
    {
        return self::findOne(["recipient_code" => $userLogin]);

UPDATE "recipient_mobile_login" SET "device_id"='1' WHERE "index"=2
---
    public function setDeviceID($device_id)
    {
        $this->device_id = $device_id;
        $this->save();